Revit 2027 API
SystemZoneData.Create Method
 Creates a new instance of a system-zone data domain class.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static SystemZoneData Create()
Public Shared Function Create As SystemZoneData
public:
static SystemZoneData^ Create()
static member Create : unit -> SystemZoneData
Return Value
SystemZoneData
 The newly created data domain instance.
See Also
Reference
SystemZoneData Class
Autodesk.Revit.DB.Mechanical Namespace